{"config": {"layers": [{"config": {"sparse": false, "input_dtype": "float32", "name": "input_4", "batch_input_shape": [null, 3, null, null]}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_4"}, {"config": {"sparse": false, "input_dtype": "float32", "name": "input_5", "batch_input_shape": [null, 3, null, null]}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_5"}, {"config": {"sparse": false, "input_dtype": "float32", "name": "input_6", "batch_input_shape": [null, 3, null, null]}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_6"}, {"config": {"sparse": false, "input_dtype": "float32", "name": "input_7", "batch_input_shape": [null, 3, null, null]}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_7"}, {"config": {"output_layers": [["block5_pool", 0, 0]], "input_layers": [["input_1", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 3, null, null], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_1"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block1_conv1", "dim_ordering": "th", "nb_filter": 64, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "name": "block1_conv1"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block1_conv2", "dim_ordering": "th", "nb_filter": 64, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["block1_conv1", 0, 0]]], "name": "block1_conv2"}, {"config": {"border_mode": "valid", "dim_ordering": "th", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "block1_pool"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0]]], "name": "block1_pool"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block2_conv1", "dim_ordering": "th", "nb_filter": 128, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["block1_pool", 0, 0]]], "name": "block2_conv1"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block2_conv2", "dim_ordering": "th", "nb_filter": 128, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["block2_conv1", 0, 0]]], "name": "block2_conv2"}, {"config": {"border_mode": "valid", "dim_ordering": "th", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "block2_pool"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0]]], "name": "block2_pool"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block3_conv1", "dim_ordering": "th", "nb_filter": 256, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["block2_pool", 0, 0]]], "name": "block3_conv1"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block3_conv2", "dim_ordering": "th", "nb_filter": 256, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv1", 0, 0]]], "name": "block3_conv2"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block3_conv3", "dim_ordering": "th", "nb_filter": 256, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["block3_conv2", 0, 0]]], "name": "block3_conv3"}, {"config": {"border_mode": "valid", "dim_ordering": "th", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "block3_pool"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0]]], "name": "block3_pool"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block4_conv1", "dim_ordering": "th", "nb_filter": 512, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["block3_pool", 0, 0]]], "name": "block4_conv1"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block4_conv2", "dim_ordering": "th", "nb_filter": 512, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv1", 0, 0]]], "name": "block4_conv2"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block4_conv3", "dim_ordering": "th", "nb_filter": 512, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["block4_conv2", 0, 0]]], "name": "block4_conv3"}, {"config": {"border_mode": "valid", "dim_ordering": "th", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "block4_pool"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0]]], "name": "block4_pool"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block5_conv1", "dim_ordering": "th", "nb_filter": 512, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["block4_pool", 0, 0]]], "name": "block5_conv1"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block5_conv2", "dim_ordering": "th", "nb_filter": 512, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv1", 0, 0]]], "name": "block5_conv2"}, {"config": {"border_mode": "same", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 3, "bias": true, "name": "block5_conv3", "dim_ordering": "th", "nb_filter": 512, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["block5_conv2", 0, 0]]], "name": "block5_conv3"}, {"config": {"border_mode": "valid", "dim_ordering": "th", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "block5_pool"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0]]], "name": "block5_pool"}], "name": "vgg16"}, "class_name": "Model", "inbound_nodes": [[["input_4", 0, 0]], [["input_5", 0, 0]], [["input_6", 0, 0]], [["input_7", 0, 0]]], "name": "vgg16"}, {"config": {"output_layers": [["globalmaxpooling2d_1", 0, 0]], "input_layers": [["input_2", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 512, null, null], "input_dtype": "float32", "sparse": false, "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_2"}, {"config": {"gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "axis": 1, "mode": 0, "name": "batchnormalization_1", "momentum": 0.99}, "class_name": "BatchNormalization", "inbound_nodes": [[["input_2", 0, 0]]], "name": "batchnormalization_1"}, {"config": {"border_mode": "valid", "nb_col": 1, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 1, "bias": true, "name": "convolution2d_1", "dim_ordering": "th", "nb_filter": 512, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "convolution2d_1"}, {"config": {"gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "axis": 1, "mode": 0, "name": "batchnormalization_2", "momentum": 0.99}, "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "batchnormalization_2"}, {"config": {"border_mode": "valid", "nb_col": 1, "subsample": [1, 1], "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "nb_row": 1, "bias": true, "name": "convolution2d_2", "dim_ordering": "th", "nb_filter": 512, "trainable": true, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "convolution2d_2"}, {"config": {"dim_ordering": "th", "trainable": true, "name": "globalmaxpooling2d_1"}, "class_name": "GlobalMaxPooling2D", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "globalmaxpooling2d_1"}], "name": "model_1"}, "class_name": "Model", "inbound_nodes": [[["vgg16", 1, 0]], [["vgg16", 2, 0]], [["vgg16", 3, 0]], [["vgg16", 4, 0]]], "name": "model_1"}, {"config": {"trainable": true, "name": "reshape_1", "target_shape": [1, 512]}, "class_name": "Reshape", "inbound_nodes": [[["model_1", 1, 0]]], "name": "reshape_1"}, {"config": {"trainable": true, "name": "reshape_2", "target_shape": [1, 512]}, "class_name": "Reshape", "inbound_nodes": [[["model_1", 2, 0]]], "name": "reshape_2"}, {"config": {"trainable": true, "name": "reshape_3", "target_shape": [1, 512]}, "class_name": "Reshape", "inbound_nodes": [[["model_1", 3, 0]]], "name": "reshape_3"}, {"config": {"trainable": true, "name": "reshape_4", "target_shape": [1, 512]}, "class_name": "Reshape", "inbound_nodes": [[["model_1", 4, 0]]], "name": "reshape_4"}, {"config": {"arguments": {}, "output_mask": null, "mode_type": "raw", "output_shape_type": "raw", "output_mask_type": "raw", "output_shape": null, "concat_axis": 1, "mode": "concat", "name": "merge_1", "dot_axes": -1}, "class_name": "Merge", "inbound_nodes": [[["reshape_1", 0, 0], ["reshape_2", 0, 0], ["reshape_3", 0, 0], ["reshape_4", 0, 0]]], "name": "merge_1"}, {"config": {"trainable": true, "name": "globalmaxpooling1d_1"}, "class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["merge_1", 0, 0]]], "name": "globalmaxpooling1d_1"}, {"config": {"output_layers": [["dense_2", 0, 0]], "input_layers": [["input_3", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 512], "input_dtype": "float32", "sparse": false, "name": "input_3"}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_3"}, {"config": {"gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "axis": 1, "mode": 0, "name": "batchnormalization_3", "momentum": 0.99}, "class_name": "BatchNormalization", "inbound_nodes": [[["input_3", 0, 0]]], "name": "batchnormalization_3"}, {"config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "activation": "relu", "b_regularizer": null, "input_dim": 512, "name": "dense_1", "bias": true, "output_dim": 256, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "dense_1"}, {"config": {"trainable": true, "W_regularizer": null, "activity_regularizer": null, "activation": "softmax", "b_regularizer": null, "input_dim": 256, "name": "dense_2", "bias": true, "output_dim": 8, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}, "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0]]], "name": "dense_2"}], "name": "model_2"}, "class_name": "Model", "inbound_nodes": [[["globalmaxpooling1d_1", 0, 0]]], "name": "model_2"}], "input_layers": [["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0], ["input_7", 0, 0]], "output_layers": [["model_2", 1, 0]], "name": "model_3"}, "class_name": "Model", "keras_version": "1.2.0"}